Setup dependencies and initialize connection

In [7]:
import os
import pandas as pd
import mysql.connector
from mysql.connector import Error
from dotenv import load_dotenv

load_dotenv()

con = mysql.connector.connect(
  host=os.environ["DB_HOST"],
  port=os.environ["DB_PORT"],
  user=os.environ["DB_USERNAME"],
  password=os.environ["DB_PASSWORD"],
)

def execute_query(connection, query):
    cursor = connection.cursor(dictionary=True)
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return pd.DataFrame(result)
    except Error as e:
        print(f"The error '{e}' occurred")
        return None

def execute_sql_file(connection, file_path):
    cursor = connection.cursor(buffered=True)
    try:
        with open(file_path, 'r') as file:
            sql_script = file.read()
        for statement in sql_script.split(';'):
            if statement.strip():
                cursor.execute(statement)
        connection.commit()
        print("SQL file executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

print("Done")

Done

Seed Database

In [8]:
execute_sql_file(con, "seed.sql")

SQL file executed successfully

List all products

In [12]:
execute_query(con, "SELECT * FROM products")

   id        name   price
0   1      Laptop  999.99
1   2  Smartphone  499.99
2   3      Tablet  299.99